# Реализуйте выдачу случайного числа (или алгоритм перемешивания списка)

x = int(input('введите число x'))
y = int(input('введите число y'))
z = int(input('введите число z'))
z = x ^ y**2
print('x = ', x)
print('y = ', y)
print('z = ', z)