#Напишите программу, которая будет преобразовывать десятичное число в двоичное.
#*Пример:*

# 45 -> 101101
# 3 -> 11


n = int(input("введите десятичное число"))
print (bin(n))
